{
  "_name_or_path": "m-a-p/MERT-v1-95M",
  "activation_dropout": 0.0,
  "apply_spec_augment": true,
  "architectures": [
    "MERTModel"
  ],
  "attention_dropout": 0.1,
  "attention_relax": -1.0,
  "auto_map": {
    "AutoConfig": "configuration_MERT.MERTConfig",
    "AutoModel": "modeling_MERT.MERTModel"
  },
  "bos_token_id": 1,
  "classifier_proj_size": 256,
  "conv_bias": false,
  "conv_dim": [
    512,
    512,
    512,
    512,
    512,
    512,
    512
  ],
  "conv_kernel": [
    10,
    3,
    3,
    3,
    3,
    2,
    2
  ],
  "conv_stride": [
    5,
    2,
    2,
    2,
    2,
    2,
    2
  ],
  "ctc_loss_reduction": "sum",
  "ctc_zero_infinity": false,
  "deepnorm": false,
  "do_stable_layer_norm": false,
  "eos_token_id": 2,
  "feat_extract_activation": "gelu",
  "feat_extract_dropout": 0.0,
  "feat_extract_norm": "group",
  "feat_proj_dropout": 0.1,
  "feat_proj_layer_norm": true,
  "feature_extractor_cqt": false,
  "feature_extractor_cqt_bins": 336,
  "final_dropout": 0.1,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout": 0.1,
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-05,
  "layerdrop": 0.05,
  "mask_feature_length": 10,
  "mask_feature_min_masks": 0,
  "mask_feature_prob": 0.0,
  "mask_time_length": 10,
  "mask_time_min_masks": 2,
  "mask_time_prob": 0.05,
  "model_type": "mert_model",
  "num_attention_heads": 12,
  "num_conv_pos_embedding_groups": 16,
  "num_conv_pos_embeddings": 128,
  "num_feat_extract_layers": 7,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "sample_rate": 24000,
  "tokenizer_class": "Wav2Vec2CTCTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.24.0",
  "use_weighted_layer_sum": false,
  "vocab_size": 32
}
